## Plan for api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 1 to add, 2 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.api_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "api_policies"  {
      ~ id      = "3388005528" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForlayer",
                          - "ecr:BatchGetImage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ca-central-1:507252742351:repository/scan-websites/api"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "sns:Publish"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sns:ca-central-1:507252742351:owasp-zap-urls",
                          - "arn:aws:sns:ca-central-1:507252742351:nuclei-urls",
                          - "arn:aws:sns:ca-central-1:507252742351:axe-core-urls",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "kms:GenerateDataKey*",
                          - "kms:Decrypt",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kms:ca-central-1:507252742351:key/f0adf18d-9e68-4641-be1a-55a6a91cca02"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:Put*",
                          - "s3:ListBucketVersions",
                          - "s3:ListBucket",
                          - "s3:GetBucketLocation",
                          - "s3:Get*",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::scan-websites-production-owasp-zap-report-data/*",
                          - "arn:aws:s3:::scan-websites-production-owasp-zap-report-data",
                          - "arn:aws:s3:::scan-websites-production-nuclei-report-data/*",
                          - "arn:aws:s3:::scan-websites-production-nuclei-report-data",
                          - "arn:aws:s3:::scan-websites-production-github-report-data/*",
                          - "arn:aws:s3:::scan-websites-production-github-report-data",
                          - "arn:aws:s3:::scan-websites-production-axe-core-report-data/*",
                          - "arn:aws:s3:::scan-websites-production-axe-core-report-data",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              ~ (known after apply),
                # (3 unchanged elements hidden)
            ]
            # (2 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # aws_api_gateway_stage.api will be updated in-place
  ~ resource "aws_api_gateway_stage" "api" {
      - cache_cluster_size    = "0.5" -> null
        id                    = "ags-s50ry4jhg5-v1"
        tags                  = {}
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_policy.api will be updated in-place
  ~ resource "aws_iam_policy" "api" {
        id        = "arn:aws:iam::507252742351:policy/scan-websites-api"
        name      = "scan-websites-api"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForlayer",
                          - "ecr:BatchGetImage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ca-central-1:507252742351:repository/scan-websites/api"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "sns:Publish"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sns:ca-central-1:507252742351:owasp-zap-urls",
                          - "arn:aws:sns:ca-central-1:507252742351:nuclei-urls",
                          - "arn:aws:sns:ca-central-1:507252742351:axe-core-urls",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "kms:GenerateDataKey*",
                          - "kms:Decrypt",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kms:ca-central-1:507252742351:key/f0adf18d-9e68-4641-be1a-55a6a91cca02"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:Put*",
                          - "s3:ListBucketVersions",
                          - "s3:ListBucket",
                          - "s3:GetBucketLocation",
                          - "s3:Get*",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::scan-websites-production-owasp-zap-report-data/*",
                          - "arn:aws:s3:::scan-websites-production-owasp-zap-report-data",
                          - "arn:aws:s3:::scan-websites-production-nuclei-report-data/*",
                          - "arn:aws:s3:::scan-websites-production-nuclei-report-data",
                          - "arn:aws:s3:::scan-websites-production-github-report-data/*",
                          - "arn:aws:s3:::scan-websites-production-github-report-data",
                          - "arn:aws:s3:::scan-websites-production-axe-core-report-data/*",
                          - "arn:aws:s3:::scan-websites-production-axe-core-report-data",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_sns_topic.dynamic-scan-urls will be created
  + resource "aws_sns_topic" "dynamic-scan-urls" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = "arn:aws:kms:ca-central-1:507252742351:key/f0adf18d-9e68-4641-be1a-55a6a91cca02"
      + name                        = "dynamic-scan-urls"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags                        = {
          + "CostCenter" = "scan-websites-production"
        }
      + tags_all                    = {
          + "CostCenter" = "scan-websites-production"
        }
    }

Plan: 1 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  + dynamic_scan_urls_topic_arn = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.scan_websites_certificate"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_access"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api_cloudwatch"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.scan-websites"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.axe-core-urls"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.dynamic-scan-urls"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.nuclei-urls"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.owasp-zap-urls"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.body_exclusions"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.google_auth_uri"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_web_acl.api_waf"]
WARN - plan.json - main - Missing Common Tags: ["module.rds.aws_iam_policy.read_connection_string"]

30 tests, 8 passed, 22 warnings, 0 failures, 0 exceptions

```

</details>
